/*******************************************************************************

   File: CO_OD.h
   CANopen Object Dictionary.

   Copyright (C) 2004-2008 Janez Paternoster

   License: GNU Lesser General Public License (LGPL).

   <http://canopennode.sourceforge.net>

   (For more information see <CO_SDO.h>.)
*/
/*
   This program is free software: you can redistribute it and/or modify
   it under the terms of the GNU Lesser General Public License as published by
   the Free Software Foundation, either version 3 of the License, or
   (at your option) any later version.

   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU Lesser General Public License for more details.

   You should have received a copy of the GNU Lesser General Public License
   along with this program.  If not, see <http://www.gnu.org/licenses/>.


   Author: Janez Paternoster


   This file was automatically generated with CANopenNode Object
   Dictionary Editor. DON'T EDIT THIS FILE MANUALLY !!!!

*******************************************************************************/

#ifndef _CO_OD_H
#define _CO_OD_H


/*******************************************************************************
   CANopen DATA DYPES
*******************************************************************************/
   typedef uint8_t      UNSIGNED8;
   typedef uint16_t     UNSIGNED16;
   typedef uint32_t     UNSIGNED32;
   typedef uint64_t     UNSIGNED64;
   typedef int8_t       INTEGER8;
   typedef int16_t      INTEGER16;
   typedef int32_t      INTEGER32;
   typedef int64_t      INTEGER64;
   typedef float32_t    REAL32;
   typedef float64_t    REAL64;
   typedef char_t       VISIBLE_STRING;
   typedef oChar_t      OCTET_STRING;
   typedef domain_t     DOMAIN;


/*******************************************************************************
   FILE INFO:
      FileName:     IO
      FileVersion:  3.0
      CreationTime: 15:03:02
      CreationDate: 2013-10-30
      CreatedBy:    -
*******************************************************************************/


/*******************************************************************************
   DEVICE INFO:
      VendorName:     Paternoster
      VendorNumber:   0
      ProductName:    CANopenNode
      ProductNumber:  0
*******************************************************************************/


/*******************************************************************************
   FEATURES
*******************************************************************************/
   #define CO_NO_SYNC                     1   //Associated objects: 1005, 1006, 1007, 2103, 2104
   #define CO_NO_EMERGENCY                1   //Associated objects: 1014, 1015
   #define CO_NO_SDO_SERVER               1   //Associated objects: 1200
   #define CO_NO_SDO_CLIENT               0   
   #define CO_NO_RPDO                     4   //Associated objects: 1400, 1401, 1402, 1403, 1600, 1601, 1602, 1603
   #define CO_NO_TPDO                     4   //Associated objects: 1800, 1801, 1802, 1803, 1A00, 1A01, 1A02, 1A03
   #define CO_NO_NMT_MASTER               0   


/*******************************************************************************
   OBJECT DICTIONARY
*******************************************************************************/
   #define CO_OD_NoOfElements             114


/*******************************************************************************
   TYPE DEFINITIONS FOR RECORDS
*******************************************************************************/
/*1018      */ typedef struct{
               UNSIGNED8      maxSubIndex;
               UNSIGNED32     vendorID;
               UNSIGNED32     productCode;
               UNSIGNED32     revisionNumber;
               UNSIGNED32     serialNumber;
               }              OD_identity_t;

/*1200[1]   */ typedef struct{
               UNSIGNED8      maxSubIndex;
               UNSIGNED32     COB_IDClientToServer;
               UNSIGNED32     COB_IDServerToClient;
               }              OD_SDOServerParameter_t;

/*1400[4]   */ typedef struct{
               UNSIGNED8      maxSubIndex;
               UNSIGNED32     COB_IDUsedByRPDO;
               UNSIGNED8      transmissionType;
               }              OD_RPDOCommunicationParameter_t;

/*1600[4]   */ typedef struct{
               UNSIGNED8      numberOfMappedObjects;
               UNSIGNED32     mappedObject1;
               UNSIGNED32     mappedObject2;
               UNSIGNED32     mappedObject3;
               UNSIGNED32     mappedObject4;
               UNSIGNED32     mappedObject5;
               UNSIGNED32     mappedObject6;
               UNSIGNED32     mappedObject7;
               UNSIGNED32     mappedObject8;
               }              OD_RPDOMappingParameter_t;

/*1800[4]   */ typedef struct{
               UNSIGNED8      maxSubIndex;
               UNSIGNED32     COB_IDUsedByTPDO;
               UNSIGNED8      transmissionType;
               UNSIGNED16     inhibitTime;
               UNSIGNED8      compatibilityEntry;
               UNSIGNED16     eventTimer;
               UNSIGNED8      SYNCStartValue;
               }              OD_TPDOCommunicationParameter_t;

/*1A00[4]   */ typedef struct{
               UNSIGNED8      numberOfMappedObjects;
               UNSIGNED32     mappedObject1;
               UNSIGNED32     mappedObject2;
               UNSIGNED32     mappedObject3;
               UNSIGNED32     mappedObject4;
               UNSIGNED32     mappedObject5;
               UNSIGNED32     mappedObject6;
               UNSIGNED32     mappedObject7;
               UNSIGNED32     mappedObject8;
               }              OD_TPDOMappingParameter_t;


/*******************************************************************************
   STRUCTURES FOR VARIABLES IN DIFFERENT MEMORY LOCATIONS
*******************************************************************************/
#define  CO_OD_FIRST_LAST_WORD     0x55 //Any value from 0x01 to 0xFE. If changed, EEPROM will be reinitialized.

/***** Structure for RAM variables ********************************************/
struct sCO_OD_RAM{
               UNSIGNED32     FirstWord;

/*1001      */ UNSIGNED8      errorRegister;
/*1002      */ UNSIGNED32     manufacturerStatusRegister;
/*1003      */ UNSIGNED32     preDefinedErrorField[8];
/*1010      */ UNSIGNED32     storeParameters[1];
/*1011      */ UNSIGNED32     restoreDefaultParameters[1];
/*2100      */ OCTET_STRING   errorStatusBits[10];
/*2103      */ UNSIGNED16     SYNCCounter;
/*2104      */ UNSIGNED16     SYNCTime;
/*2105      */ UNSIGNED8      OPERATING_MODE;
/*2106      */ UNSIGNED8      OPERATING_MODE_DISPLAY;
/*2107      */ UNSIGNED8      STATUS_CODE;
/*2200      */ INTEGER16      JOINT_FORCE_CONSTANT;
/*2201      */ INTEGER16      JOINT_POSITION_CONSTANT;
/*2202      */ INTEGER16      JOINT_VELOCITY_CONSTANT;
/*2203      */ INTEGER16      JOINT_PID_GAIN_CONSTANT;
/*2204      */ INTEGER16      JOINT_FORCE_SETPOINT_MAX[2];
/*2205      */ INTEGER16      JOINT_POSITION_SETPOINT_MAX[2];
/*2206      */ INTEGER16      JOINT_POSITION_SETPOINT_MIN[2];
/*2207      */ INTEGER16      JOINT_VELOCITY_SETPOINT_MAX[2];
/*2208      */ INTEGER16      JOINT_FORCE_SETPOINT[2];
/*2209      */ INTEGER16      JOINT_POSITION_SETPOINT[2];
/*220A      */ INTEGER16      JOINT_VELOCITY_SETPOINT[2];
/*220B      */ INTEGER16      JOINT_FORCE_ESTIMATE[2];
/*220C      */ INTEGER16      JOINT_POSITION_ESTIMATE[2];
/*220D      */ INTEGER16      JOINT_VELOCITY_ESTIMATE[2];
/*220E      */ INTEGER16      JOINT_FORCE_DEMAND[2];
/*220F      */ INTEGER16      JOINT_POSITION_P_GAIN[2];
/*2210      */ INTEGER16      JOINT_POSITION_I_GAIN[2];
/*2211      */ INTEGER16      JOINT_POSITION_D_GAIN[2];
/*2213      */ REAL32         JOINT_POSITION_SENSOR_BIAS[2];
/*2214      */ REAL32         JOINT_POSITION_SENSOR_GAIN[2];
/*2215      */ REAL32         JOINT_POSITION_SENSOR_OFFSET[2];
/*2216      */ REAL32         JOINT_POSITION_DEADBAND[2];
/*2217      */ INTEGER16      JOINT_FORCE_ESTIMATE_MAX[2];
/*2218      */ INTEGER16      JOINT_POSITION_ESTIMATE_MAX[2];
/*2219      */ INTEGER16      JOINT_POSITION_ESTIMATE_MIN[2];
/*221A      */ INTEGER16      JOINT_VELOCITY_ESTIMATE_MAX[2];
/*221B      */ REAL32         JOINT_POSITION_I_LIMIT[2];
/*2300      */ REAL32         MOTOR_FORCE_SETPOINT_MAX[2];
/*2301      */ REAL32         MOTOR_CURRENT_SETPOINT_MAX[2];
/*2302      */ REAL32         MOTOR_FORCE_SETPOINT[2];
/*2303      */ REAL32         MOTOR_CURRENT_SETPOINT[2];
/*2304      */ REAL32         MOTOR_FORCE_ESTIMATE[2];
/*2305      */ REAL32         MOTOR_CURRENT_ESTIMATE[2];
/*2306      */ REAL32         MOTOR_FORCE_FF_CONSTANT[2];
/*2307      */ REAL32         MOTOR_FORCE_P_GAIN[2];
/*2308      */ REAL32         MOTOR_FORCE_I_GAIN[2];
/*2309      */ REAL32         MOTOR_FORCE_D_GAIN[2];
/*230A      */ REAL32         MOTOR_FORCE_ESTIMATE_BREAK_FREQUENCY[2];
/*230B      */ REAL32         MOTOR_CURRENT_P_GAIN[2];
/*230C      */ REAL32         MOTOR_CURRENT_I_GAIN[2];
/*230D      */ REAL32         MOTOR_FORCE_SENSOR_BIAS[2];
/*230E      */ REAL32         MOTOR_FORCE_SENSOR_GAIN[2];
/*230F      */ REAL32         MOTOR_FORCE_SENSOR_OFFSET[2];
/*2310      */ REAL32         MOTOR_CURRENT_SENSOR_BIAS[2];
/*2311      */ REAL32         MOTOR_CURRENT_SENSOR_GAIN[2];
/*2312      */ REAL32         MOTOR_CURRENT_SENSOR_OFFSET[2];
/*2313      */ REAL32         MOTOR_CURRENT_DEMAND[2];
/*2314      */ REAL32         MOTOR_FORCE_DEADBAND[2];
/*2315      */ REAL32         MOTOR_FORCE_ESTIMATE_MAX[2];
/*2316      */ REAL32         MOTOR_CURRENT_ESTIMATE_MAX[2];
/*2317      */ REAL32         MOTOR_FORCE_I_LIMIT[2];
/*2318      */ REAL32         MOTOR_CURRENT_I_LIMIT[2];
/*2319      */ REAL32         MOTOR_FORCE_RATE_OF_CHANGE_ESTIMATE_BREAK_FREQUENCY[2];
/*231A      */ REAL32         MOTOR_POSITION_MEASUREMENT[2];
/*231B      */ REAL32         MOTOR_VELOCITY_ESTIMATE[2];
/*231C      */ REAL32         MOTOR_VELOCITY_ESTIMATE_BREAK_FREQUENCY[2];
/*231D      */ REAL32         MOTOR_POSITION_SENSOR_GAIN[2];
/*231E      */ REAL32         MOTOR_POSITION_SENSOR_OFFSET[2];
/*231F      */ REAL32         MOTOR_FORCE_RATE_OF_CHANGE_ESTIMATE[2];
/*2320      */ REAL32         MOTOR_FORCE_MEASUREMENT[2];
/*2321      */ INTEGER16      JOINT_POSITION_MEASUREMENT[2];
/*2322      */ REAL32         JOINT_POSITION_ESTIMATE_BREAK_FREQUENCY[2];
/*2323      */ REAL32         JOINT_VELOCITY_ESTIMATE_BREAK_FREQUENCY[2];
/*2324      */ REAL32         MOTOR_FORCE_REFERENCE[2];
/*2325      */ REAL32         MOTOR_FORCE_REFERENCE_BREAK_FREQUENCY[2];
/*6000      */ UNSIGNED8      readInput8Bit[8];
/*6200      */ UNSIGNED8      writeOutput8Bit[8];
/*6401      */ INTEGER16      readAnalogueInput16Bit[12];
/*6411      */ INTEGER16      writeAnalogueOutput16Bit[8];

               UNSIGNED32     LastWord;
};

/***** Structure for EEPROM variables *****************************************/
struct sCO_OD_EEPROM{
               UNSIGNED32     FirstWord;



               UNSIGNED32     LastWord;
};


/***** Structure for ROM variables ********************************************/
struct sCO_OD_ROM{
               UNSIGNED32     FirstWord;

/*1000      */ UNSIGNED32     deviceType;
/*1005      */ UNSIGNED32     COB_ID_SYNCMessage;
/*1006      */ UNSIGNED32     communicationCyclePeriod;
/*1007      */ UNSIGNED32     synchronousWindowLength;
/*1008      */ VISIBLE_STRING manufacturerDeviceName[8];
/*1009      */ VISIBLE_STRING manufacturerHardwareVersion[4];
/*100A      */ VISIBLE_STRING manufacturerSoftwareVersion[4];
/*1014      */ UNSIGNED32     COB_ID_EMCY;
/*1015      */ UNSIGNED16     inhibitTimeEMCY;
/*1016      */ UNSIGNED32     consumerHeartbeatTime[4];
/*1017      */ UNSIGNED16     producerHeartbeatTime;
/*1018      */ OD_identity_t  identity;
/*1019      */ UNSIGNED8      synchronousCounterOverflowValue;
/*1029      */ UNSIGNED8      errorBehavior[6];
/*1200[1]   */ OD_SDOServerParameter_t SDOServerParameter[1];
/*1400[4]   */ OD_RPDOCommunicationParameter_t RPDOCommunicationParameter[4];
/*1600[4]   */ OD_RPDOMappingParameter_t RPDOMappingParameter[4];
/*1800[4]   */ OD_TPDOCommunicationParameter_t TPDOCommunicationParameter[4];
/*1A00[4]   */ OD_TPDOMappingParameter_t TPDOMappingParameter[4];
/*1F80      */ UNSIGNED32     NMTStartup;
/*2101      */ UNSIGNED8      CANNodeID;
/*2102      */ UNSIGNED16     CANBitRate;

               UNSIGNED32     LastWord;
};


/***** Declaration of Object Dictionary variables *****************************/
extern struct sCO_OD_RAM CO_OD_RAM;

extern struct sCO_OD_EEPROM CO_OD_EEPROM;

extern struct sCO_OD_ROM CO_OD_ROM;


/*******************************************************************************
   ALIASES FOR OBJECT DICTIONARY VARIABLES
*******************************************************************************/
/*1000, Data Type: UNSIGNED32 */
      #define OD_deviceType                              CO_OD_ROM.deviceType

/*1001, Data Type: UNSIGNED8 */
      #define OD_errorRegister                           CO_OD_RAM.errorRegister

/*1002, Data Type: UNSIGNED32 */
      #define OD_manufacturerStatusRegister              CO_OD_RAM.manufacturerStatusRegister

/*1003, Data Type: UNSIGNED32, Array[8] */
      #define OD_preDefinedErrorField                    CO_OD_RAM.preDefinedErrorField
